Repository: RedTurtle/pas.plugins.velruse
Catalog: pas/plugins/velruse/locales/*/LC_MESSAGES/pas.plugins.velruse.po
Languages: it

source: Allows users to log in with social networks through Velruse
it: Permette agli utenti di autenticarsi nel sito usando Velruse

source: Authentication services enabled
it: Servizi di autenticazione abilitati

source: Back to general Velruse settings
it: Torna alle impostazioni generali di Velruse

source: Blacklist management
it: Gestione della blacklist

source: Blacklisted?
it: In blacklist?

source: Cancel
it: Annulla

source: Changes saved
it: Modifiche memorizzate

source: Connection timeout
it: Timeout connessione

source: Edit cancelled
it: Modifiche annullate

source: General site settings
it: Impostazioni generali del sito

source: Icon
it: Icona

source: Load blacklist
it: Carica blacklist

source: Name
it: Nome

source: No entries in the blacklist
it: Nessun elemento della blacklist

source: No results
it: Nessun risultato

source: PAS plugins configuration
it: Configurazione dei plugin PAS

source: Remove selected
it: Rimuovi selezionati

source: Remove user
it: Rimuovi utente

source: Remove?
it: Rimuovere?

source: Save
it: Salva

source: Search
it: Cerca

source: Search for Velruse users
it: Cerca utenti Velruse

source: Settings saved
it: Modifiche Salvate

source: Site login enabled
it: Login del sito abilitato

source: URL or path
it: URL o percorso

source: Users management
it: Gestione utenti

source: Velruse authentication plugin
it: Plugin di autenticazione Velruse

source: Velruse integration settings
it: Impostazioni integrazione Velruse

source: You can perform authentication with one of those services
it: Puoi autenticarti usando uno dei seguenti servizi

source: blacklist_management_help
it: Se hai eliminato un utente non sarai più in grado di trovarlo dal modulo qui sopra. Usa questo modulo per ripulire vecchi inserimenti nella black list

source: given_roles_help
it: Un insieme di ruoli che il plugin dovrà automaticamente fornire agli utenti autenticati

source: given_roles_label
it: Ruoli utente

source: help_activated_plugins
it: Fornisci una lista di servizi di autenticazioni configurati sul backend Verlruse

source: help_connection_timeout
it: Massimo numero di secondi per aspettare una risposta da Velruse

source: help_site_login_enabled
it: Se selezionato, il login predefinito di Plone verrà mantenuto

source: help_velruse_settings_form
it: Configura come Plone comunica con il backend Velruse

source: no_plugin_activated
it: L'autenticazione con altri servizi non è disponibile. Contatta l'amministratore del sito.

source: plone_login
it: Login del sito

source: plugins-config-help
it: Seleziona un plugin PAS per gestirne la configurazione

source: user_management_help
it: Da questa sezione puoi ricercare gli utenti memorizzati nel plugin. Questo significa: utenti che hanno eseguito il log-in usando questo backend Velruse. Puoi cancellare i dati degli utenti memorizzare e/o metterli nella blacklist. Gli utenti nella blacklisr non sono in grado di autenticarsi di nuovo (può essere utile per bloccare utenti spammer o troll).

source: users_delete_message
it: $count utenti eliminati

source: velruse_auth_info_path_help
it: Imposta il percordo di auth info

source: velruse_auth_info_path_label
it: Percordo di auth info Velruse

source: velruse_backend_icon_help
it: Un URL (può essere anche un percorso relativo) ad un'icona da mostrare nella form di login. Formato migliore è 64x64px.

source: velruse_backend_name_help
it: Nome del social network/sistema di autenticazione

source: velruse_backend_url_help
it: Un URL (può anche essere un percordo relativo) a Velruse. Questo URL deve essere configurato a dovere in Velruse per chiamare il servizio remoto di autenticazione

source: velruse_login
it: Login con...

source: velruse_plugin_config
it: Impostazioni ${plugin_name}

source: velruse_server_host_help
it: Imposta un host del server dove Velruse è in ascolto

source: velruse_server_host_label
it: Host server Velruse
